/*
Задайте строку, содержащую латинские буквы в обоих регистрах. Сформируйте строку, в которой все заглавные буквы заменены на строчные.
*/
string line = "LoVe";
string result = line.ToLower();
System.Console.WriteLine(result);
